{
	"name": "ControlClan 0.2.0",
	"description": "ControllClan is an anti-troll-tool for guildmaster and limits access for clan members based on the clan rank. It does not grant addional access rights other than the existing. There are also commands for admins to enforce server-wide interacting and placing rules.\n\n- Rank Settings are configurable and persistant per clan for each rank by guild master.\n- Defaults are applied instantly to all clans when the mod is active.\n- A base area for the clan can be setup by the guild master for fine-grained protection; it is area based (cylinder).\n- Placeables and Thralls can have personalized access for interaction by name them like the owner with prefix [OWNER], case-insensitive. Placeables and Thralls can have free access for interaction of any clan member by name the with prefix [public] or [GUILDNAME], case-insensitive. There are no addional owner checks beside the names. Name-Checks are applied when reentering base.\n- Doors are not affected and can be used as normal (since they have an addional interaction blocker).\n- Outside the base are no interaction restrictions for any rank.\n- Settings are lost on clan or member name changes.\n- Items of the global survival whitelist can always be placed anywhere: beds and bedrolls.\n- In Follower Management dialog only guild masters are allowed to use the context menu.\n\nConsole command usage:\ndc clan\ndc clan base X Y RADIUS\ndc clan base show|hide\ndc clan rank RANK TARGET LEVEL\nWORK-IN PROGRESS:\ndc ccglobal\ndc ccglobal guildcheck true|false\ndc ccglobal guildenforcer true|false\n\n---\nList rank settings and base location (can be used by every guild member; guildmaster can see all ranks):\nCommand: dc clan\n\n---\nSet clan's primary base protection area (by guildmaster):\nCommand: dc clan base X Y RADIUS\nRules: Interaction checks are based on player location. Placement checks are based on object location.\n\n---\nTurn temporary messages when then clan base is passed for the current player on or off:\nCommand: dc clan base show|hide\nThis setting is not persistent.\n\n---\nChange setting (by guildmaster):\ndc clan rank RANK TARGET LEVEL\nwhere:\nRANK one of: recruit member officer all\nTARGET one of: building placeable npc all\nLEVEL one of: none nobase noplace nopersonal full\n\n\nAdjustable Targets\n- building\n- placeable\n- npc\n\n\nAdjustment Levels:\n- none: Building prohibited except global survival whitelist. Interacting outside base allowed.\n- nobase: Action just prohibited within claimed clan area, outside full access.\n- noplace: Can Interact everwhere, can place only outside claimed clan area.\n- nopersonal: Can Place and Interact everwhere except placeables and NPC in base named like a clan member\n- full: Can Place and Interact everwhere (as normal). Can access others private goods.\n\nSummary of levels and actions that can be adjusted independly for buildings, placeables and NPCs:\nnone: No placing. Interacting only outside base.\nnobase: Like none, plus allows placing outside base.\nnoplace: Like nobase, plus allows interacting inside base (except others personal assets). \nnopersonal: Like nobase, plus allows placing inside base.\nfull: No restrictions, including access of others personal assets.\n\nRank defaults:\n- Recruit: none for all targets. Very restrictive, but full controll over clan's server resources.\n- Member: nobase for all targets. Just protect the base.\n- Officer: nopersonal for all targets. Full trust, just grant some privacy in clan.\n\n---\nAdmin flags to enforce server rules:\ndc ccglobal guildenforcer on|off\n\nguildenforcer: If turned on (default off), placing by guild-less members is surpressed.\n\nList settings:\ndc ccglobal\n",
	"changeNote": "",
	"author": "Fortuna Cournot",
	"authorUrl": "https://steamcommunity.com/id/FortunaCournot/myworkshopfiles/",
	"versionMajor": 0,
	"versionMinor": 2,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2390566531",
	"steamVisibility": 0,
	"folderName": "ControlClan",
	"revisionNumber": 269506,
	"snapshotId": 27677
}